#pragma once
#include "Object.h"
#include "input.h"
#include "Sound.h"

#define STAGE_X	   (10)	//横のマス数
#define STAGE_Y	   (20)	//縦のマス数
#define BLOCK_SIZE (22)	//1マスのサイズ

#define Ball_Max (999)

class Game
{
private:
	Input input;
	Sound sound;

	Object stage;
	Object ball[999];

	Object title;		//タイトルオブジェクト
	Object result;		//タイトルオブジェクト
	Object scoreUI;
	Object button;

	Object scoreboard; //スコアオブジェクト
	Object Maxcolorvalue; //スコアオブジェクト

	Object blocks[STAGE_X][STAGE_Y];	//ブロックオブジェクト
	int data[STAGE_X][STAGE_Y + 3] = {};	//データ配列
	int count = 0;	//自動落下のカウント
	int block = 0;
	int state = 0;	//ゲームの状態　0:落下するものが無い、1:落下中
	
	int score = 0;	//得点
	int MaxColor = 1;	//色の数

	int scene = 0;	//シーン(0：タイトル　1：ゲーム)

	//int TetriminoType;		//テトリミノの種類(0～6)
	//int TetriminoDirection;	//テトリミノの向き(0～3)

	//int TetriminoData[7][4][4][4] = {
	//	{
	//		//直線
	//			{//0
	//				{0,0,0,0},
	//				{0,0,0,0},
	//				{2,2,2,2},
	//				{0,0,0,0},
	//			},
	//			{//1
	//				{0,0,2,0},
	//				{0,0,2,0},
	//				{0,0,2,0},
	//				{0,0,2,0},
	//			},
	//			{//2
	//				{0,0,0,0},
	//				{2,2,2,2},
	//				{0,0,0,0},
	//				{0,0,0,0},
	//			},
	//			{//3
	//				{0,2,0,0},
	//				{0,2,0,0},
	//				{0,2,0,0},
	//				{0,2,0,0},
	//			},
	//	},
	//	{
	//		//四角
	//			{//0
	//				{0,0,0,0},
	//				{0,2,2,0},
	//				{0,2,2,0},
	//				{0,0,0,0},
	//			},
	//			{//1
	//				{0,0,0,0},
	//				{0,2,2,0},
	//				{0,2,2,0},
	//				{0,0,0,0},
	//			},
	//			{//2
	//				{0,0,0,0},
	//				{0,2,2,0},
	//				{0,2,2,0},
	//				{0,0,0,0},
	//			},
	//			{//3
	//				{0,0,0,0},
	//				{0,2,2,0},
	//				{0,2,2,0},
	//				{0,0,0,0},
	//			},
	//	},
	//	{
	//		//S字
	//			{//0
	//				{0,0,0,0},
	//				{0,0,0,0},
	//				{2,2,0,0},
	//				{0,2,2,0},
	//			},
	//			{//1
	//				{0,0,0,0},
	//				{0,0,2,0},
	//				{0,2,2,0},
	//				{0,2,0,0},
	//			},
	//			{//2
	//				{0,0,0,0},
	//				{2,2,0,0},
	//				{0,2,2,0},
	//				{0,0,0,0},
	//			},
	//			{//3
	//				{0,0,0,0},
	//				{0,2,0,0},
	//				{2,2,0,0},
	//				{2,0,0,0},
	//			},
	//	},
	//	{
	//		//逆S字
	//			{//0
	//				{0,0,0,0},
	//				{0,0,0,0},
	//				{0,2,2,0},
	//				{2,2,0,0},
	//			},
	//			{//1
	//				{0,0,0,0},
	//				{0,2,0,0},
	//				{0,2,2,0},
	//				{0,0,2,0},
	//			},
	//			{//2
	//				{0,0,0,0},
	//				{0,2,2,0},
	//				{2,2,0,0},
	//				{0,0,0,0},
	//			},
	//			{//3
	//				{0,0,0,0},
	//				{2,0,0,0},
	//				{2,2,0,0},
	//				{0,2,0,0},
	//			},
	//	},
	//	{
	//		//逆L字
	//			{//0
	//				{0,0,0,0},
	//				{0,0,0,0},
	//				{2,2,2,0},
	//				{2,0,0,0},
	//			},
	//			{//1
	//				{0,0,0,0},
	//				{2,0,0,0},
	//				{2,0,0,0},
	//				{2,2,0,0},
	//			},
	//			{//2
	//				{0,0,0,0},
	//				{0,0,0,0},
	//				{0,0,2,0},
	//				{2,2,2,0},
	//			},
	//			{//3
	//				{0,0,0,0},
	//				{2,2,0,0},
	//				{0,2,0,0},
	//				{0,2,0,0},
	//			},
	//	},
	//	{
	//		//L字
	//			{//0
	//				{0,0,0,0},
	//				{0,0,0,0},
	//				{2,2,2,0},
	//				{0,0,2,0},
	//			},
	//			{//1
	//				{0,0,0,0},
	//				{0,2,2,0},
	//				{0,2,0,0},
	//				{0,2,0,0},
	//			},
	//			{//2
	//				{0,0,0,0},
	//				{2,0,0,0},
	//				{2,2,2,0},
	//				{0,0,0,0},
	//			},
	//			{//3
	//				{0,0,0,0},
	//				{0,2,0,0},
	//				{0,2,0,0},
	//				{2,2,0,0},
	//			},
	//	},
	//	{
	//		//T字
	//			{//0
	//				{0,0,0,0},
	//				{0,0,0,0},
	//				{2,2,2,0},
	//				{0,2,0,0},
	//			},
	//			{//1
	//				{0,0,0,0},
	//				{0,2,0,0},
	//				{0,2,2,0},
	//				{0,2,0,0},
	//			},
	//			{//2
	//				{0,0,0,0},
	//				{0,2,0,0},
	//				{2,2,2,0},
	//				{0,0,0,0},
	//			},
	//			{//3
	//				{0,0,0,0},
	//				{0,2,0,0},
	//				{2,2,0,0},
	//				{0,2,0,0},
	//			},
	//	},
	//};

public:
	void Init(HWND hWnd);
	void Draw();
	void Uninit();
	void Update();

	/*void Animation();
	void BlockSpawn();
	void Rotation();
	void FallBlock();
	void LeftMove();
	void RightMove();
	void BlockColor();*/

	void DrawScore();
	void Buttonsize();

	void Ballinit();
	void StageRotation(int);
	void BallSpawn(int);
	void FallBall();
	void Gameinit();
	void Arrange();
	void Arrange_Color(Object);

	bool CircleHit(Object, Object);
	bool SerchCircleHit(Object, Object);

};

